const teamIcon = (team_name) => {
  try {
    const icon = {
      中信兄弟: "<:cpbl_b:1480803510122582116>",
      味全龍: "<:cpbl_d:1480803513100402722>",
      富邦悍將: "<:cpbl_g:1480803514673270804>",
      "統一7-ELEVEn獅": "<:cpbl_u:1480803511452307547>",
      樂天桃猿: "<:cpbl_r:1480803516342866012>",
      台鋼雄鷹: "<:cpbl_t:1480803517651222619>",
      三商: "<:cpbl_Tiger:1275824989441888266>",
      兄弟: "<:cpbl_B_O:1275825371744571455>",
      時報: "<:cpbl_E:1275825666914386065>",
      俊國: "<:cpbl_Bears:1275825871898411100>",
      興農: "<:cpbl_S:1275826268700672041>",
      中信: "<:cpbl_W:1275826947745775728>",
      第一: "<:cpbl_L:1275827544351965194>",
      誠泰: "<:cpbl_C:1275827950838874122>",
      Lamigo: "<:cpbl_Lamigo:1275828301214253138>",
      米迪亞: "<:cpbl_T_REX:1275828691842371704>",
      義大: "<:cpbl_Rhino:1275828995019247770>",
      中信兄弟二軍: "<:cpbl_b:1480803510122582116>",
      味全龍二軍: "<:cpbl_d:1480803513100402722>",
      富邦悍將二軍: "<:cpbl_g:1480803514673270804>",
      "統一7-ELEVEn獅二軍": "<:cpbl_u:1480803511452307547>",
      樂天桃猿二軍: "<:cpbl_r:1480803516342866012>",
      台鋼雄鷹二軍: "<:cpbl_t:1480803517651222619>",
      ACN011: "<:cpbl_b:1480803510122582116>",
      AAA011: "<:cpbl_d:1480803513100402722>",
      AEO011: "<:cpbl_g:1480803514673270804>",
      ADD011: "<:cpbl_u:1480803511452307547>",
      AJL011: "<:cpbl_r:1480803516342866012>",
      AKP011: "<:cpbl_t:1480803517651222619>",
      ACN022: "<:cpbl_b:1480803510122582116>",
      AAA022: "<:cpbl_d:1480803513100402722>",
      AEO022: "<:cpbl_g:1480803514673270804>",
      ADD022: "<:cpbl_u:1480803511452307547>",
      AJL022: "<:cpbl_r:1480803516342866012>",
      AKP022: "<:cpbl_t:1480803517651222619>",
    };

    return icon[team_name] || " ";
  } catch (error) {
    return " ";
  }
};

const gameType = (type) => {
  switch (type) {
    case "A":
      return "一軍例行賽";
    case "B":
      return "一軍明星賽";
    case "C":
      return "一軍總冠軍賽";
    case "D":
      return "二軍例行賽";
    case "E":
      return "一軍季後挑戰賽";
    case "F":
      return "二軍總冠軍賽";
    case "G":
      return "一軍熱身賽";
    case "H":
      return "未來之星邀請賽";
    default:
      return "";
  }
};

module.exports = { teamIcon, gameType };
